Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t
Struct for the camera and view data of toleration events.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.CameraLocation
The camera location.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.CameraDirection
The camera direction.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.CameraUpDirection
The camera up direction.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.WorldId
The world identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.WindowId
The window identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.InteractorId
The interactor identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.ProjectionType
The projection type (ortho or perpsective).

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.Mouse2DX
The mouse X location in pixels.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.Mouse2DY
The mouse Y location in pixels.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.ViewWidth
The view width in pixels.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.ViewHeight
The view height in pixels.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.ViewId
The view identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.TolerationTolerance
The tolerance for toleration.